{
  "title": "E-Log: Fine-Grained Elastic Log-Based Anomaly",
  "abstract": "",
  "key_concepts": [],
  "experiment_setup": {},
  "iotdb_tsbs_experiment": {
    "section": "2820 IEEE TRANSACTIONS ON SERVICES COMPUTING, VOL. 18, NO. 5, SEPTEMBER/OCTOBER 2025\n[22] S. Xie et al., “TVDiag: A task-oriented and view-invariant failure diagnosis\nframework for microservice-based systems with multimodal data,” ACM\nTrans. Softw. Eng. Methodol. , 2025.\n[23] M. Poess, R. Nambiar, K. Kulkarni, C. Narasimhadevara, T. Rabl, and\nH.-A. Jacobsen, “Analysis of TPCx-IoT: The ﬁrst industry standard bench-\nmark for IoT gateway systems,” in Proc. IEEE 34th Int. Conf. Data Eng. ,\n2018, pp. 1519–1530.\n[24] Timescale, “TSBS,” Jan. 2024. [Online]. Available: https://github.com/\ntimescale/tsbs\n[25] R. Liu and J. Yuan, “Benchmarking time series databases with iotdb-\nbenchmark for iot scenarios,” 2019, arXiv:1901.08304 .\n[26] G. Li et al., “openGauss: An autonomous database system,” Proc. VLDB\nEndowment , vol. 14, no. 12, pp. 3028–3042, 2021.\n[27] X. Zhou et al., “Dbmind: A self-driving platform in opengauss,” Proc.\nVLDB Endowment , vol. 14, no. 12, pp. 2743–2746, 2021.\n[28] P. He, J. Zhu, Z. Zheng, and M. R. Lyu, “Drain: An online log parsing\napproach with ﬁxed depth tree,” in Proc. IEEE Int. Conf. Web Serv. , 2017,\npp. 33–40.\n[29] J. Zhu et al., “Tools and benchmarks for automated log parsing,” in\nProc. IEEE/ACM 41st Int. Conf. Softw. Eng., Softw. Eng. Pract. , 2019,\npp. 121–130.\n[30] V.-H. Le and H. Zhang, “Log-based anomaly detection with deep learn-\ning: How far are we?,” in Proc. 44th Int. Conf. Softw. Eng. , 2022,\npp. 1356–1367.\n[31] H. Li, W. Shang, B. Adams, M. Sayagh, and A. E. Hassan, “A qualitative\nstudy of the beneﬁts and costs of logging from developers’ perspectives,”\nIEEE Trans. Softw. Eng. , vol. 47, no. 12, pp. 2858–2873, Dec. 2021.\n[32] J. Zhu, S. He, P. He, J. Liu, and M. R. Lyu, “Loghub: A large collection of\nsystem log datasets towards automated log analytics,” in Proc. 34nd Int.\nSymp. Softw. Rel. Eng. , 2023, pp. 355–366.\n[33] H. Li, Alluxio: A Virtual Distributed File System . Berkeley, CA, USA:\nUniv. California Press, 2018.\n[34] H. Liu and R. Setiono, “Feature selection and classiﬁcation–A probabilistic\nwrapper approach,” in Industrial and Engineering Applications or Artiﬁ-\ncial Intelligence and Expert Systems . Boca Raton, FL, USA: CRC Press,\n2022, pp. 419–424.\n[35] T. Zhang, H. Qiu, G. Castellano, M. Rifai, C. S. Chen, and F. Pianese,\n“System log parsing: A survey,” IEEE Trans. Knowl. Data Eng. , vol. 35,\nno. 8, pp. 8596–8614, Aug. 2023.\n[36] D. Seybold and J. Domaschka, “Benchmarking-as-a-service for cloud-\nhosted DBMS,” in Proc. 22nd Int. Middleware Conf., Demos Posters , 2021,\npp. 12–13.\n[37] L. Wu, J. Tordsson, J. Bogatinovski, E. Elmroth, and O. Kao, “MicroDiag:\nFine-grained performance diagnosis for microservice systems,” in Proc.\nIEEE/ACM Int. Workshop Cloud Intell. , 2021, pp. 31–36.\n[38] V. Jeyakumar, O. Madani, A. Parandeh, A. Kulshreshtha, W. Zeng, and\nN. Yadav, “Explainit!–A declarative root-cause analysis engine for time\nseries data,” in Proc. Int. Conf. Manage. Data , 2019, pp. 333–348.\n[39] D. Liu et al., “MicroHECL: High-efﬁcient root cause localization in large-\nscale microservice systems,” in Proc. IEEE/ACM 43rd Int. Conf. Softw.\nEng., Softw. Eng. Pract. , 2021, pp. 338–347.\n[40] P. Liu et al., “FluxRank: A widely-deployable framework to automatically\nlocalizing root cause machines for software service failure mitigation,” in\nProc. IEEE 30th Int. Symp. Softw. Rel. Eng. , 2019, pp. 35–46.\n[41] S. Sarkar, D. Staratzis, Z. Zhu, and M. Athanassoulis, “Constructing and\nanalyzing the LSM compaction design space,” Proc. VLDB Endowment ,\nvol. 14, no. 11, pp. 2216–2229, 2021.\n[42] S. Sarkar, N. Dayan, and M. Athanassoulis, “The LSM design space and its\nread optimizations,” in Proc. IEEE Int. Conf. Data Eng. , 2023, 3578–3584.\n[43] C. Mesh, “A powerful chaos engineering platform for kubernetes,” Chaos\nMesh , 2021. Accessed: Aug. 18, 2025. [Online]. Available: https://chaos-\nmesh.org/\n[44] W. Meng et al., “Loganomaly: Unsupervised detection of sequential and\nquantitative anomalies in unstructured logs,” in Proc. 28th Int. Joint Conf.\nArtif. Intell. , 2019, vol. 19, no. 7, pp. 4739–4745.\n[45] P. Liu, S. Zhang, Y. Sun, Y. Meng, J. Yang, and D. Pei, “Fluxinfer:\nAutomatic diagnosis of performance anomaly for online database sys-\ntem,” in Proc. IEEE 39th Int. Perform. Comput. Commun. Conf. , 2020,\npp. 1–8.\n[46] Y. Remil, A. Bendimerad, R. Mathonat, P. Chaleat, and M. Kaytoue,\n“”What makes my queries slow?”: Subgroup discovery for SQL workload\nanalysis,” in Proc. 36th IEEE/ACM Int. Conf. Automated Softw. Eng. , 2021,\npp. 642–652.[47] P. Dintyala, A. Narechania, and J. Arulraj, “SQLCheck: Automated de-\ntection and diagnosis of SQL anti-patterns,” in Proc. ACM SIGMOD Int.\nConf. Manage. Data , 2020, pp. 2331–2345.\n[48] D. Dundjerski and M. Tomaševi´ c, “Automatic database troubleshooting\nof azure SQL databases,” IEEE Trans. Cloud Comput. , vol. 10, no. 3,\npp. 1604–1619, Jul.–Sep. 2022.\n[49] B. Glasbergen, M. Abebe, K. Daudjee, and A. Levi, “Sentinel: Universal\nanalysis and insight for data systems,” Proc. VLDB Endowment , vol. 13,\nno. 12, pp. 2720–2733, 2020.\n[50] C. Seo, Y. Chae, J. Lee, E. Seo, and B. Tak, “NoSQL database performance\ndiagnosis through system call-level introspection,” in Proc. IEEE/IFIP\nNetw. Operations Manage. Symp. , 2022, pp. 1–9.\n[51] P. Dexter, B. Sendir, and K. Chiu, “Detecting and reacting to anomalies in\nrelaxed uses of raft,” in Proc. 20th IEEE/ACM Int. Symp. Cluster, Cloud\nInternet Comput. , 2020, pp. 659–668.\n[52] X. Han and S. Yuan, “Unsupervised cross-system log anomaly detection\nvia domain adaptation,” in Proc. 30th ACM Int. Conf. Inf. Knowl. Manage. ,\n2021, pp. 3068–3072.\n[53] Y. Liu et al., “Uniparser: A uniﬁed log parser for heterogeneous log data,”\ninProc. ACM Web Conf. , 2022, pp. 1893–1901.\n[54] L. Zhang, T. Jia, M. Jia, Y. Wu, H. Liu, and Y. Li, “ScalaLog: Scalable\nlog-based failure diagnosis using LLM,” in Proc. IEEE Int. Conf. Acoust.,\nSpeech Signal Process. , 2025, pp. 1–5.\n[55] G. Chu et al., “Anomaly detection on interleaved log data with semantic\nassociation mining on log-entity graph,” IEEE Trans. Softw. Eng. , vol. 51,\nno. 2, pp. 581–594, Feb. 2025.\n[56] M. Landauer, F. Skopik, and M. Wurzenberger, “A critical review of com-\nmon log data sets used for evaluation of sequence-based anomaly detection\ntechniques,” Proc. ACM Softw. Eng. , vol. 1, no. FSE, pp. 1354–1375,\n2024.\n[57] H. Guo et al., “LogFormer: A pre-train and tuning pipeline for log\nanomaly detection,” in Proc. AAAI Conf. Artif. Intell. , 2024, vol. 38, no. 1,\npp. 135–143.\n[58] S. Hashemi and M. Mäntylä, “OneLog: Towards end-to-end software\nlog anomaly detection,” Automated Softw. Eng. , vol. 31, no. 2, 2024,\nArt. no. 37.\n[59] L. Zhang, T. Jia, K. Wang, M. Jia, Y. Yang, and Y. Li, “Reducing events\nto augment log-based anomaly detection models: An empirical study,”\ninProc. 18th ACM/IEEE Int. Symp. Empirical Softw. Eng. Meas. , 2024,\npp. 538–548.\n[60] L. Zhang et al., “Towards close-to-zero runtime collection overhead: Raft-\nbased anomaly diagnosis on system faults for distributed storage system,”\nIEEE Trans. Serv. Comput. , vol. 18, no. 2, pp. 1054–1067, Mar./Apr. 2025.\n[61] L. Zhang, T. Jia, M. Jia, Y. Wu, H. Liu, and Y. Li, “XRAGLog: A\nresource-efﬁcient and context-aware log-based anomaly detection method\nusing retrieval-augmented generation,” in Proc. AAAI Workshop Prevent-\ning Detecting LLM Misinformation , 2025.\n[62] N. Zhao et al., “An empirical investigation of practical log anomaly\ndetection for online service systems,” in Proc. 29th ACM Joint Meeting Eur.\nSoftw. Eng. Conf. Symp. Foundations Softw. Eng. , 2021, pp. 1404–1415.\n[63] Y. Li et al., “Exploring the effectiveness of llms in automated logging\ngeneration: An empirical study,” 2023, arXiv:2307.05950 .\n[64] L. Zhang, Y. Zhai, T. Jia, X. Huang, C. Duan, and Y. Li, “Agentfm: Role-\naware failure management for distributed databases with LLM-driven\nmulti-agents,” in Proc. 33rd ACM Int. Conf. Found. Soft. Eng. , 2025,\npp. 525–529.\n[65] L. Zhang et al., “Thinkﬂ: Self-reﬁning failure localization for microservice\nsystems via reinforcement ﬁne-tuning,” 2025, arXiv:2504.18776 .\n[66] L. Zhang, T. Jia, M. Jia, and Y. Li, “LogDB: Multivariate log-based\nfailure diagnosis for distributed databases (Extended from multilog),”\n2025, arXiv:2505.01676 .\n[67] L. Zhang et al., “A survey of AIOps in the era of large language models,”\nACM Comput. Surveys , 2025.\n[68] M. He, T. Jia, C. Duan, H. Cai, Y. Li, and G. Huang, “Weakly-supervised\nlog-based anomaly detection with inexact labels via multi-instance learn-\ning,” in Proc. IEEE/ACM 47th Int. Conf. Softw. Eng. , 2025, pp. 2918–2930.\n[69] P. Xiao, T. Jia, C. Duan, H. Cai, Y. Li, and G. Huang, “LogCAE: An\napproach for log-based anomaly detection with active learning and con-\ntrastive learning,” in Proc. IEEE 35th Int. Symp. Softw. Rel. Eng. , 2024,\npp. 144–155.\n[70] M. He, T. Jia, C. Duan, H. Cai, Y. Li, and G. Huang, “LLMeLog: An\napproach for anomaly detection based on llm-enriched log events,” in\nProc. IEEE 35th Int. Symp. Softw. Rel. Eng. , 2024, pp. 132–143.\nAuthorized licensed use limited to: WUHAN UNIVERSITY OF TECHNOLOGY. Downloaded on October 26,2025 at 15:51:24 UTC from IEEE Xplore.  Restrictions apply. ",
    "position": 26
  },
  "threshold_settings": [],
  "metrics": []
}